export const details_scheme = {
  page_name: "Shakuf Timeline",
  
  page_title: "Shakuf Timeline",
  cover_photo: "https://shakuf.co.il/wp-content/uploads/2022/11/שקוף-לוגו-חלקי-2020-שחור.svg",
  logo_url: "https://shakuf.co.il/wp-content/uploads/2022/11/שקוף-לוגו-חלקי-2020-שחור.svg",

  header: {
    text: "Header",
  },

  footer: {
    text: "Footer",
  },
}

export const content_scheme = {
  events: [
    {
      title: "הצגת הרפורמה המשפטית",
      date: "2023-01-04"
    },
    {
      title: "תחילת ההפגנות ומחאה נגד ממשלת ישראל",
      date: "2023-01-07"
    },
    {
      title: "שר הביטחון, יואב גלנט - מפוטר",
      date: "2023-03-26"
    },
    {
      title: "שביתה כללית במשק",
      date: "2023-03-27"
    },
    {
      title: "השהיית הרפורמה המשפטית",
      date: "2023-03-27"
    },
    {
      title: "תחילת הפגנות של תומכי הרפורמה",
      date: "2023-03-27"
    },
    {
      title: "ביטול עילת הסבירות",
      date: "2023-06-24"
    },
    {
      title: "7 באוקטובר - מתקפת הפתע על ישראל",
      date: "2023-07-10"
    },
    {
      title: "פסילת החוק לביטול עילת הסבירות",
      date: "2024-01-01"
    },
  ],

  articles: [
    {
      title: "",
      content: '',
      date: "",
      full_article: "",
      main_picture: ""
    },
    {
      title: "משה גפני מנע ניסיון של הליכוד והציונות הדתית לעקוף את ועדת הכספים",
      content: 'ההצעה שנפלה: ועדה חדשה ל"תכנון כלכלי" שבראשה ח"כ ממפלגתו של שר האוצר • גפני: "לא בעד ועדה שתדון רק בנושאים שהממשלה רוצה" • הכנסת שיבצה את הח"כים בוועדות השונות בהסכמת הצדדים - וסיימה את המחלוקת העזה בנושא • הוועדה לביקורת המדינה תוקם לאחר היעדר של שנה וחצי • לאופוזיציה לא תהיה ועדה משמעותית, ייצוג הנשים לוקה בחסר, ועדיין אין זכר לוועדת האתיקה',
      date: "2023-01-04",
      full_article: "https://shakuf.co.il/40395",
      main_picture: "https://shakuf.co.il/wp-content/uploads/2023/01/משה-גפני-הוועדה-המסדרת-נועם-מושקוביץ-דוברות-הכנסת-4.1.23.jpg"
    },
    {
      title: 'הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש',
      content: 'הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש ',

      date: "2023-01-12",

      full_article: "https://shakuf.co.il/47505",
      main_picture: "https://shakuf.co.il/wp-content/uploads/2024/02/היישוב-אבשלום-בעוטף-עזה-צילום-אנדריי-דוסטוב.jpeg"
    },
    {
      title: 'הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש',
      content: 'הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש ',

      date: "2023-02-15",

      full_article: "https://shakuf.co.il/47505",
      main_picture: "https://shakuf.co.il/wp-content/uploads/2024/02/היישוב-אבשלום-בעוטף-עזה-צילום-אנדריי-דוסטוב.jpeg"
    },
    {
      title: 'הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש',
      content: 'הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש ',

      date: "2023-03-20",

      full_article: "https://shakuf.co.il/47505",
      main_picture: "https://shakuf.co.il/wp-content/uploads/2024/02/היישוב-אבשלום-בעוטף-עזה-צילום-אנדריי-דוסטוב.jpeg"
    },
    {
      title: 'הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש',
      content: 'הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש הציבור צמא לדיון אמיתי ברפורמה המשפטית, אך הח"כים סיפקו לתקשורת קרקס צפוי מראש ',

      date: "2023-04-29",

      full_article: "https://shakuf.co.il/47505",
      main_picture: "https://shakuf.co.il/wp-content/uploads/2024/02/היישוב-אבשלום-בעוטף-עזה-צילום-אנדריי-דוסטוב.jpeg"
    },
  ]
}

export const statistics_scheme = {

}

/*
  const document = doc(db, "shakuf", "details");
  setDoc(document, details_scheme);

  const document2 = doc(db, "shakuf", "content");
  setDoc(document2, content_scheme);

  const document3 = doc(db, "shakuf", "statistics");
  setDoc(document3, statistics_scheme);
*/